# Програма яка здійснює конвертацію секунд в хвилини, години та дні.

# Функція яка здійснює розрахунок часу на основі введених секунд.
def converter(seconds):
    minutes, seconds = divmod(seconds, 60)
    hours, minutes = divmod(minutes, 60)
    days, hours = divmod(hours, 24)

    # Словник який використовується для належного виводу результату конвертування.
    converter_dict = {
        'days': days,
        'hours': hours,
        'minutes': minutes,
        'seconds': seconds
    }

    return converter_dict

# Головна частина, яка запитує дані від користувача в тому числі і дані які будуть оброблятися функцією.
if __name__ == '__main__':
    print('Вітаю користувач! Я допоможу Вам конвертувати секунди у дні, години та хвилини.')
    user_name = input("Як Вас звати? ")
    print(f'Супер, {user_name}, починаємо!')

    # Цикл, з постійним повторенням, до моменту коректного вводу та обробки інформації через функцію.
    while True:
        user_input = input('Введіть кількість секунд для опрацювання: ')
        try:
            seconds = int(user_input)
            # Якщо маємо ввод від користувача з відємним значенням, або з 0 то повідомляємо про помилку.
            if seconds <= 0:
                print('Нажаль я не можу конвертувати те чого не має, потрібно вводити секунди від 1. Спробуй ще!')
            else:
                result = converter(seconds)
                print(result)
                print(f'Дякую, що завітали, до нових зустрічей {user_name}!')
                break
        # У разі коли користувач вводить не числа -> повідомляємо про помилку.
        except ValueError:
            print('Нажаль це не числа, тому я не можу це сконвертувати, спробуй ще!')