# Програма для перевірки чи є введене користувачем число простим.
# user_input - введені дані від користувача.

# Список простих чисел від 1го до 100, який робимо через множину.
simple_set = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97}

# Функція, що обробляє введене число та перевіряє чи є це число в множині simple_set.
def prime_numbers(number):
    return number in simple_set

# Запитуємо дані від користувача та виводимо відповідь.
if __name__ == '__main__':
    print('Вітаю тебе користувач! Це програма, яка перевіряє, чи є введене число простим (працюю з числами від 1 до 100).')

    while True:
        try:
            user_input = int(input('Будь-ласка введіть число яке бажаєте перевірити: '))

            # Зазначаємо якщо користувач вводить число яке менше за 1 але більше за 100 то програма не обробляє його.
            if user_input < 1 or user_input > 100:
                print('Наголошую, що програма працює в діапазоні від 1 до 100.')
                continue

            # Надаємо різні варіанти відповідей в залежності від того чи є число простим чи ні.
            results = prime_numbers(user_input)
            if results:
                print(f'Число {user_input} є простим.')
                break
            else:
                print(f'Число {user_input} не є простим.')
                break
        except Exception:
            print('Нажаль Ви ввели не число, спробуйте, ще.')

    print('Дякую, що скористались нашою програмою, до нових зустрічей!')

