# radian - радіани

# import math - спочатку імпортуємо модуль який необхідний для виконання математичних розрахунків.
import math

# Функція виконує конвертацію градусів у радіани за допомогою прописаної формули та округлює результат до 5 знаків після коми.
def convert_degrees_to_radians(degrees):
    radian = round((degrees * math.pi / 180), 5)
    return radian

# Виконуємо головну частину программи через блок if __name__ == "__main__", що запитує дані від користувача та передає їх у вищезазначену функцію, за результатом якої ми отримуємо відповідь.
if __name__ == "__main__":
    print('Вас вітає програма, яка конвертує градуси у радіани.')

    # У разі якщо користувач вводить не число, то ми повідомляємо йому через цикл про помилку, який буде повторюватись поки не введуть число.
    while True:
        user_input = input('Введіть градуси для конвертації у радіани: ')
        try:
            degrees = float(user_input)
            break
        except ValueError:
            print('І, що це? Я так працювати не можу, потрібно вводити число. Швидко спробуй ще!')

    # Через раніше записану функцію здійснюємо обчислення радіану, та виводимо відповідь.
    radian = convert_degrees_to_radians(degrees)

    print('Радіан становить:')
    print(radian)
    print('Дякуємо, що скористалися нашою програмою.')
