# Програма, що перевіряє існування трикутника та обчислює його периметр і площу.
# Імпортуємо з модуль math функцію sqrt для математичних розрахунків.
from math import sqrt


# Ввод даних від користувача. У разі якщо користувач вводить НЕ число, або число 0 чи число з (-) то повідомляємо про помилку.
def user_input_data(prompt):
    while True:
        value = input(prompt)
        try:
            value = float(value)
            if value > 0:
                return value
            else:
                print(
                    'Інформуємо Вас про те, що потрібно ввести додатнє число (просто нагадую, що це число яке більше за 0). Давай ще раз.')
        except Exception:
            print('О ні-ні-ні! Це ще, що таке? Потрібно ввести додатнє число! Швиденько спробуй ще!')


# Перевіряємо чи існує трикутник за введеними користувачем сторонами.
def triangle_exists(a, b, c):
    if a + b > c and b + c > a and a + c > b:
        return True
    else:
        return False


# Обчислюємо периметр трикутника, у разі якщо результат обчислення периметру не ціле цисло то округлюємо до 2х чисел після крапки.
def perimeter(a, b, c):
    perimeter_value = a + b + c
    return round(perimeter_value, 2)


# Обчислюємо площу трикутника, у разі якщо результат обчислення площі не ціле цисло то округлюємо до 2х чисел після крапки.
def area(a, b, c):
    half_p = perimeter(a, b, c) / 2
    area_value = sqrt(half_p * (half_p - a) * (half_p - b) * (half_p - c))
    return round(area_value, 2)

# Частина програми, яка запитує дані від користувача та вподальшому опрацьовує їх.
if __name__ == "__main__":
    print('Вас вітає програма, що перевіряє чи існує трикутник за вказаними сторонами, та розраховує його периметр і площу.')
    a = user_input_data('Введіть будь-ласка довжину першої сторони трикутника: ')
    b = user_input_data('Введіть будь-ласка довжину другої сторони трикутника: ')
    c = user_input_data('Введіть будь-ласка довжину третьої сторони трикутника: ')

    # Надаємо відповідь по позиціям у разі якщо трикутник існує за допомогою прописанних функцій.
    if triangle_exists(a, b, c):
        perimeter_value = perimeter(a, b, c)
        area_value = area(a, b, c)
        print('Супер! Ваш трикутник існує!')
        print('Периметр цього трикутника становить:', perimeter_value)
        print('Площа трикутника становить:', area_value)
    else:
        print('Ну, що ж, сумно, але трикутник не існує.')