#Невеличка розважальна  програма, що проводить  діалог з користувачем та виконує заміну слова в реченні.
#name - ім'я користувача.
#answer (answer2, answer3, answer4, answer5) - відповіді користувача.
#comment (comment2, comment3) - коментар програми (до якого застосовано один із методів (зміна регістру, видалення символів, видалення зайвих відступів з правого кінця строки).
#replace - дія яка полягає в заміні обраного слова на інше.


name = input("Привіт. Як тебе звати? ")
print("Привіт,", name)
print("В мене є підозра, що ти БОТ.")
answer = input("Напиши слово (або словосполучення) використовуючи літери с верхнім регістром, символи пунктуації та зайві пробіли з правого кінця строки  ")
print("Ой, ні, щось читати боляче.")
print("Я трішки виправив ->", (((answer.translate({ord(i): None for i in '.,-:;?!'})).lower())).rstrip())
answer3 = input("Розповідай чим займаєшся, що вивчаєш -> ")
print("Нічого собі, яка поважна людина.")
answer4 = input("Яке саме слово бажаешь коригувати в тексті? ")
print("Ага, бачу (",answer4, ") під індексом:" )
print(answer3.index(answer4))
answer5 = input("На яке слово бажаєш замінити? -> ")
replace = answer3.replace(answer4, answer5)
print("Завдання виконано, можеш не дякувати:")
print(replace)

