#Невеличка розважальна  програма, що проводить  діалог з користувачем та виконує заміну слова в реченні.
#name - ім'я користувача.
#answer (answer2, answer3, answer4, answer5) - відповіді користувача.
#comment (comment2, comment3) - коментар програми (до якого застосовано один із методів (зміна регістру, видалення символів, видалення зайвих відступів з правого кінця строки).
#replace - дія яка полягає в заміні обрано слова на інше.


name = input("Привіт. Як тебе звати? ")
print("Привіт,", name)
answer = input("В мене є підозра, що ти БОТ, а напиши: ПалЯнИцЯ ")
if answer == 'ПалЯнИцЯ':
   print("Ой, ні, щось читати боляче.")
   print("Я трішки виправив ->", (answer.lower()))
else:
    print('Скопіював би, що ти мучишся')
    comment = 'ПалЯнИцЯ'
    print("Все одно я би виправив цей скажений правовис на гарний ->", (comment.lower()))
answer2 = input("Ти знаєш, немає довіри до тебе, напиши тоді: -Венгардіум Левіосса!!!")
if answer2 == '-Венгардіум Левіосса!!!':
   print("А ну все зрозуміло, з тебе ніякий Гаррі Поттер.")
   print("Це була перевірка, потрібно спокійніше, без зайвих позначок ось як в мене ->", (answer2.translate({ord(i): None for i in '.,-:;?!'})))
else:
    print('Жах, пиши уважніше!')
    comment2 = '-Венгардіум Левіосса!!!'
    print("Бачиш як потрібно, без кіпішу ->", (comment2.translate({ord(i): None for i in '.,-:;?!'})))
comment3 = 'Добре-добре, я бачу ти серйозно налаштована особа.    '
print(comment3.rstrip())
answer3 = input("Розповідай чим займаєшся -> ")
print("Нічого собі, яка поважна людина.")
answer4 = input("Яке саме слово бажаешь коригувати в тексті? ")
print("Ага, бачу (",answer4, ") під індексом:" )
print(answer3.index(answer4))
answer5 = input("На яке слово бажаєш замінити? -> ")
replace = answer3.replace(answer4, answer5)
print("Завдання виконано, можеш не дякувати:")
print(replace)

