#Невеличка розважальна  програма, що проводить  діалог з користувачем та виконує заміну слова в реченні.
#name - ім'я користувача.
#answer - відповідь користувача (до якої застосовано (зміна регістру, видалення символів, видалення зайвих відступів з правого кінця строки).
#answer2 (answer3, answer4) - відповідь користувача (в якій буде здійснюватись заміна слова або словосполучення, пошук індексу слова)
#replace - дія яка полягає в заміні обраного слова на інше.


name = input("Привіт. Як тебе звати? ")
print("Привіт,", name)
print("В мене є підозра, що ти БОТ.")
answer = input("Напиши слово (або словосполучення) використовуючи літери з верхнім регістром, символи пунктуації (.,-:;?!) та зайві пробіли з правого кінця строки:  ")
print("Ой, ні, щось читати боляче.")
print("Я трішки виправив ->", (((answer.translate({ord(i): None for i in '.,-:;?!'})).lower())).rstrip())
answer2 = input("Розповідай чим займаєшся, що вивчаєш -> ")
print("Нічого собі, яка поважна людина.")
answer3 = input("Яке саме слово бажаешь коригувати в тексті? ")
print("Ага, бачу (",answer3, ") під індексом:" )
print(answer2.index(answer3))
answer4 = input("На яке слово бажаєш замінити? -> ")
replace = answer2.replace(answer3, answer4)
print("Завдання виконано, можеш не дякувати:")
print(replace)

