name = input("Привіт. Як тебе звати? ")
print("Привіт,", name)
answer = input("В мене є підозра, що ти БОТ, а напиши: ПалЯнИцЯ ")
if answer == 'ПалЯнИцЯ':
   print("Ой, ні, щось читати боляче.")
   print("Я трішки виправив ->", (answer.lower()))
else:
    print('Скопіював би, що ти мучишся')
    palyanucya = 'ПалЯнИцЯ'
    print("Все одно я би виправив цей скажений правовис на гарний ->", (palyanucya.lower()))
answer2 = input("Ти знаєш, немає довіри до тебе, напиши тоді: -Венгардіум Левіосса!!!")
if answer2 == '-Венгардіум Левіосса!!!':
   print("А ну все зрозуміло, з тебе ніякий Гаррі Поттер.")
   print("Це була перевірка, потрібно спокійніше, без зайвих позначок ось як в мене ->", (answer2.translate({ord(i): None for i in '.,-:;?!'})))
else:
    print('Жах, пиши уважніше!')
    v_leviossa = '-Венгардіум Левіосса!!!'
    print("Бачиш як потрібно, без кіпішу ->", (v_leviossa.translate({ord(i): None for i in '.,-:;?!'})))
comment = 'Добре-добре, я бачу ти серйозно налаштована особа.    '
print(comment.rstrip())
answer3 = input("Розповідай чим займаєшся -> ")
print("Нічого собі, яка поважна людина.")
answer4 = input("Яке саме слово бажаешь коригувати в тексті? ")
print("Ага, бачу (",answer4, ") під індексом:" )
print(answer3.index(answer4))
answer5 = input("На яке слово бажаєш замінити? -> ")
replace = answer3.replace(answer4, answer5)
print("Завдання виконано, можеш не дякувати:")
print(replace)

