# Програма, яка перевіряє чи є введена строка паліндромом:
# user_input - введені дані від користувача.

print('Вітаю, це програма, що перевіряє чи є введена строка паліндромом.')
user_input = input('Для перевірки введіть строку та натисніть Enter: ')

# Робимо перелік розділових знаків які будуть видалені.
symbols = [' ', '\t', '\n', ',', '.', '?', '-', '!']

# Переводимо в нижній регістр, позбавляємо вказаних розділових знаків.
for symbol in symbols:
    user_input = user_input.lower().replace(symbol, '')

if user_input == user_input[::-1]:
    print('Вказана строка є паліндромом!')
    print('Дякую за користування, приходьте ще!')
else:
    print('Вказана строка не є паліндромом!')
    print('Дякую за користування, приходьте ще!')