# Генератор, який приймає параметром строку s та при кожному запиті видає наступне слово зі строки s.
def word_gen(s):
    """
    :param s: вхідний рядок.
    :yield: наступне слово з рядка s.
    """
    words = s.split()
    for word in words:
        yield word

if __name__ == '__main__':

    print("Вітаю! Це програма-генератор, що дозволяє отримати послідовні слова з введеного рядка.")

    # Ввведення користувачем рядка.
    s = input("\nВведіть рядок: ")

    # Виклик генератора з введеним рядком s та виведення кожного слова з рядку.
    for word in word_gen(s):
        print(word)

    print("\nГенерація слів завершена. До зустрічі!")