# Програма для генерації послідовності чисел Фібоначчі.

def fibonacci_generator(num_generations):
    """
    :param num_generations - параметр який визначає кількість генерацій чисел Фібоначчі.
    У кожній ітерації циклу, ми генеруємо наступне число Фібоначчі за допомогою функції генератора.
    """
    a, b = 0, 1
    for _ in range(num_generations):
        yield a
        a, b = b, a + b

if __name__ == '__main__':

    print("Вітаю тебе користувач! Ця програма генерує послідовність чисел Фібоначчі.")

    # Здійснюємо через while True ввод від користувача з заданим параметром кількості генерацій.
    # У разі якщо вводиться не числове значення повідомляємо про помилку.
    while True:
        try:
            num_generations = int(input("Будь ласка введіть бажану кількість генерацій чисел Фібоначчі: "))
            break
        except ValueError:
            print("О, ні! Наголошую, потрібно ввести числову кількість генерацій!")

    # Створення генератора послідовності чисел Фібоначчі.
    fib_sequence = fibonacci_generator(num_generations)

    # Виводимо результат генерацій, та завершуємо програму.
    print("Послідовність чисел Фібоначчі:")
    for num in fib_sequence:
        print(num)

    print("Дякую за користування програмою!")