# user_name - ім'я користувача.
user_name = input('Вітаю! Як тебе звати? ')
print('Супер,', user_name, ', починаємо!')

sum = 0
while True:
    # user_input - введені дані від користувача.
    user_input = input('Введіть число або \'sum\', щоб підрахувати суму: ')

    # Якщо введено ключове слово "sum", то тоді виводимо суму чисел та завершуємо програму, в іншому випадку повідомляємо про некоректний ввод.
    if user_input == 'sum':

        print(f'Сума введених чисел: {sum}')
        print('Програма завершена! Гарного дня до нових зустрічей,', user_name, '!')
        break

    else:

        try:
            sum += float(user_input)
        except ValueError:
            print('Помилка!,', user_name, ', Ви ввели некоректні дані!')